#include "H/SC93F843X_C.H"
#include "H/Function_Init.H"
/*****************************************************
*函数名称：void EX_Init(void)
*函数功能：外部中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void EX_Init(void)
{	
	P0CON=0X0f;     //中断IO口设置为高阻输入
	P1CON=0X00;
	P2CON=0Xfc;
	P0PH = 0xf0;
	P1PH = 0xff;
	P2PH = 0x03;

	INT0F = 0X0f ;//0000 xxxx  0关闭 1使能   设置INT00/01/02/03下降沿中断使能
	INT1F = 0X0f ;//0000 xxxx  0关闭 1使能   设置INT10/11/12/13下降沿中断使能
	INT2F = 0X3f ;//00xx xxxx  0关闭 1使能   设置INT20/21/22/23/24/25下降沿中断使能
	INT0R = 0X0f ;//0000 xxxx  0关闭 1使能   设置INT00/01/02/03上升沿中断使能
	INT1R = 0X0f ;//0000 xxxx  0关闭 1使能   设置INT10/11/12/13上升沿中断使能
	INT2R = 0X3f ;//00xx xxxx  0关闭 1使能   设置INT20/21/22/23/24/25上升沿中断使能
	
	IE = 0x85;	//0000 0x0x    //开启总中断、INT0/INT1
	IE1 = 0x08;	//0000 x000    //开启INT2
	IP = 0X00;
	IP1 = 0X00;
}

/*****************************************************
*函数名称：void EX0/1/2() interrupt	0/2/10
*函数功能：外部中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void EX0() interrupt	0
{
   P24 = ~P24;
}

void EX1() interrupt	2
{
   P25 = ~P25;
}

void EX2() interrupt	10
{
   P26 = ~P26;
}
