#include "H/SC93F843X_C.H"
#include "H/Function_Init.H"
/*****************************************************
*函数名称：void Uart0_Init(void)
*函数功能：Uart0中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void Uart0_Init(void)
{
	SCON = 0X50;   //设置通信方式为模式一，允许接收
	T2CON = 0x00;  //使用定时器1作UART时钟
	TMCON = 0X03;  //定时器时钟为fsys
	TMOD = 0X20;   //8位重载
	TH1=0x64;	     //在24M时，波特率为9600；
	TR1=1;
	EUART = 1;     //开启Uart0中断
	EA = 1;
	while(1)
	{
		SBUF = 0x55;
		delay(1000);
	}
}

/*****************************************************
*函数名称：void UartInt(void) interrupt 4
*函数功能：Uart0中断函数
*入口参数：void
*出口参数：void
*****************************************************/
void UartInt(void) interrupt 4
{
	if(TI)
	{
		TI=0;	
	  P00 = ~P00;
	}
	if(RI)
	{
		RI=0;	
	}
}

/*********************************************************
*函数名称：
*函数功能：
*入口参数：
*出口参数：
**********************************************************/
void delay(uint time)
{
	int i,j;
	for(i=time; i>0; i--)
	for(j=0; j<100; j++)
	;
}